module("coat_name", package.seeall)

local moduleName = "coat_name";
local m_database = {};
_G[moduleName] = m_database;

m_database["id_1"] = {
id = 1,
icon = 140000,
name = "最后灭却师",
desc = "世界上最后一个灭却师，继承了独特的光箭魔法，万箭穿心，不到一秒。",
}
m_database["id_2"] = {
id = 2,
icon = 140001,
name = "永恒幻术",
desc = "公认的世界上最伟大的忍者之一，掌握着强大的幻术，能让魔族陷入冰霜与烈焰的炼狱中。",
}
m_database["id_3"] = {
id = 3,
icon = 140002,
name = "黑刃剑豪",
desc = "曾经最伟大的剑豪之一，7岁学剑，11岁悟剑，15岁平步青云，对抗魔族如碾死蚂蚁般简单。",
}
m_database["id_4"] = {
id = 4,
icon = 140003,
name = "代理死神",
desc = "掌握死神之力的人，身世和血统一直是个谜，身法和速度如闪电般迅速是他的特点。",
}
m_database["id_5"] = {
id = 5,
icon = 140004,
name = "念之魔术师",
desc = "稀奇古怪的赌场怪才，爱好血腥的战斗，无时无刻不体现着他的变态美学，希望成为赌王。",
}
m_database["id_6"] = {
id = 6,
icon = 140005,
name = "死灵之王",
desc = "拥有强大魔力的远古魔灵，冰冷的血脉和邪恶的力量让他无所不能，他的力量也受到众人的垂涎。",
}
m_database["id_7"] = {
id = 7,
icon = 140006,
name = "沙暴之影",
desc = "善良的沙村村长，身体里封印着沙之神——守鹤，是世界公认的第一防御大师。",
}
m_database["id_8"] = {
id = 8,
icon = 140007,
name = "女神斗士",
desc = "他的拳可划破天空，脚可以踢裂大地，忠于智慧女神雅典娜，是维护大地正义与和平的战士。",
}
m_database["id_9"] = {
id = 9,
icon = 140008,
name = "最强冰系",
desc = "他从小便能熟练的运用冰之魔法，长大后，他成为操控邪恶冰龙的传奇战士。",
}
m_database["id_10"] = {
id = 10,
icon = 140009,
name = "冰霜之雉",
desc = "化水为冰，化冰为牢，对于他来说，防御就是最好的进攻，而防御的前提，是绝对的控制。",
}
m_database["id_11"] = {
id = 11,
icon = 140010,
name = "火之意志",
desc = "木头村的九尾少年，拥有无坚不摧的毅力，是一个把创造奇迹当做家常便饭的男孩。",
}
m_database["id_12"] = {
id = 12,
icon = 140011,
name = "超级英雄",
desc = "他原本是一个身体瘦弱的新兵，在接受美国政府的实验改造后变成了“超级战士”，拥有无坚不摧的钒合金盾。",
}
m_database["id_13"] = {
id = 13,
icon = 140012,
name = "航海王",
desc = "他性格积极乐观，爱憎分明，对任何危险的事物都超感兴趣，享受着成为海贼王的冒险旅程。",
}
m_database["id_14"] = {
id = 14,
icon = 140013,
name = "虚圈之王",
desc = "他能随意游走于人界和灵界之间，行踪飘忽而不可捉摸。与他交手，就像雾里看花。",
}
m_database["id_15"] = {
id = 15,
icon = 140014,
name = "风色青春",
desc = "一个永远把“青春”二字挂在嘴边的热血男人，爱好健美和体术，拥有用之不竭的能量。",
}
m_database["id_16"] = {
id = 16,
icon = 140015,
name = "逆刃剑客",
desc = "飞天御剑流的第十四代继承人，人在江湖行，剑出非我心，浪客剑心。",
}
m_database["id_17"] = {
id = 17,
icon = 140016,
name = "葫芦小金刚",
desc = "传奇小战士，葫芦娃葫芦娃，一根藤上七朵花，风吹雨打都不怕，啦啦啦啦啦！",
}
m_database["id_18"] = {
id = 18,
icon = 140017,
name = "王下七武海",
desc = "巴基以虐待弱者为乐趣，是个集自私、无情于一身的海贼。但他的真实能力还是个未知数。",
}
m_database["id_19"] = {
id = 19,
icon = 140018,
name = "暴怒怪物",
desc = "顶尖的科学家，却也是基因改造实验的试验品，每当情绪激动就变身成所向披靡的绿色巨人。",
}

