module("SkillInfo", package.seeall)

local moduleName = "SkillInfo";
local m_database = {};
_G[moduleName] = m_database;

m_database["id_21003"] = {
id = 21003,
name = "圣光一击",
desc = " 对敌人造成110%伤害. 净化敌人. 消除所有有利状态 \n  若拥有圣光之盾. 伤害增加80%.",
type = 1,
per = 24,
}
m_database["id_21004"] = {
id = 21004,
name = "肉弹战车",
desc = " 对敌人造成110%伤害. 并对敌人造成脱力(降低30%格挡率. 持续2回合) \n (此技能无法格挡)",
type = 1,
per = 29,
}
m_database["id_21005"] = {
id = 21005,
name = "赌注之拳",
desc = " 对敌人造成随机100%-500%伤害. 自身会虚弱(降低15%全属性. 持续3回合)",
type = 1,
per = 20,
}
m_database["id_21006"] = {
id = 21006,
name = "吸血鬼之触",
desc = " 对敌人造成105%伤害. 并对敌人造成印记(持续吸取敌人血量) \n (此次攻击带有20%吸血)",
type = 1,
per = 21,
}
m_database["id_21007"] = {
id = 21007,
name = "焚火",
desc = " 对敌人造成120%伤害. 并对敌人造成燃烧(持续损失血量. 持续3回合)",
type = 1,
per = 33,
}
m_database["id_21008"] = {
id = 21008,
name = "剧毒冲击",
desc = " 对敌人造成90%伤害. 并对敌人造成剧毒(每回合损失8%最大血量， 持续3回合)与虚弱(降低20%全属性， 持续3回合)",
type = 1,
per = 28,
}
m_database["id_21012"] = {
id = 21012,
name = "雷光闪",
desc = " 对敌人造成135%伤害. 增加自身40%速度值. 持续2回合.\n (此技能无法闪避)",
type = 1,
per = 23,
}
m_database["id_21026"] = {
id = 21026,
name = "狂怒打击",
desc = " 对敌人造成150%伤害. 增加自身40%暴击率. 持续2回合.  \n  (自身在下回合开始时损失25%当前血量)",
type = 1,
per = 19,
}
m_database["id_21016"] = {
id = 21016,
name = "圣疗",
desc = " 恢复自身30%血量. 若自身存在圣光之盾. 则获得强化(增加30%全属性. 持续2回合) \n  (每场战斗只能触发2次)",
type = 2,
per = 14,
}
m_database["id_21017"] = {
id = 21017,
name = "冰钻之盾",
desc = " 此次攻击. 增加自身30%格挡率. 获得冰系掌控. 对敌人造成霜寒(降低35%速度值. 持续2回合)",
type = 2,
per = 29,
}
m_database["id_21018"] = {
id = 21018,
name = "神风",
desc = " 此次攻击. 增加自身25%闪避率 \n  若自身血量在40%以下. 则额外增加35%闪避率.",
type = 2,
per = 19,
}
m_database["id_21019"] = {
id = 21019,
name = "盾之结界",
desc = " 此次攻击. 增加自身2倍的防御值.",
type = 2,
per = 33,
}
m_database["id_21020"] = {
id = 21020,
name = "绝对领域",
desc = " 此次攻击. 反弹敌人30%伤害. 若我方存在庇护状态. 则此次攻击增加我方50%免伤率.",
type = 2,
per = 18,
}
m_database["id_21021"] = {
id = 21021,
name = "庇护",
desc = " 增加我方25%免伤率. 持续恢复少量血量. 持续2回合.",
type = 2,
per = 22,
}
m_database["id_21022"] = {
id = 21022,
name = "圣光净化",
desc = " 回复20%血量并驱散自身不利状态. 若自身存在圣光之盾. 则刷新圣光之盾. \n  (每场战斗只能触发3次)",
type = 2,
per = 21,
}
m_database["id_21023"] = {
id = 21023,
name = "圣光之盾",
desc = " 获得一个护盾. 护盾可承受当前血量50%的伤害. \n  (每场战斗只能触发2次)",
type = 2,
per = 20,
}
m_database["id_21024"] = {
id = 21024,
name = "灵魂枷锁",
desc = " 使敌人获得灵魂枷锁(降低敌人30%重击率暴击率. 持续损失血量. 持续4回合) \n  (每场战斗只能触发1次)",
type = 2,
per = 25,
}
m_database["id_21025"] = {
id = 21025,
name = "以眼还眼",
desc = " 降低自身30%闪避率. 增加自身20%格挡率和反击率. 持续2回合.",
type = 2,
per = 20,
}
m_database["id_22012"] = {
id = 22012,
name = "九尾之力",
desc = " 当生命值小于30%时. 外套的使用者会暴走. 获得尾兽的力量(增加60%全属性) \n  (每场战斗只能触发1次)",
type = 3,
per = 100,
}
m_database["id_22001"] = {
id = 22001,
name = "绝对命中",
desc = " 我方出手时. 若血量百分比低于敌人. 则增加40%暴击率.若血量百分比高于敌人. 则降低敌人40%闪避率.",
type = 3,
per = 100,
}
m_database["id_22003"] = {
id = 22003,
name = "最强剑客",
desc = " 我方出手时. 有几率增加50%重击率.若此次攻击重击. 则获得强力(增加50%攻击力. 持续2回合)",
type = 3,
per = 30,
}
m_database["id_22005"] = {
id = 22005,
name = "伸缩自如的爱",
desc = " 我方出手时. 增加已损失血量20%的攻击力.",
type = 3,
per = 100,
}
m_database["id_22007"] = {
id = 22007,
name = "生命剥夺",
desc = " 我方出手时. 有几率恢复敌人15%已损失血量",
type = 3,
per = 20,
}
m_database["id_22010"] = {
id = 22010,
name = "冰系最强",
desc = " 我方出手时. 若存在冰系掌控. 则增加此次出手80%攻击力.",
type = 3,
per = 100,
}
m_database["id_22013"] = {
id = 22013,
name = "超级英雄",
desc = " 我方出手时. 有几率将防御力叠加到攻击力上.",
type = 3,
per = 30,
}
m_database["id_22017"] = {
id = 22017,
name = "正刃",
desc = " 我方暴击时. 有几率进行一次额外的出手回合.",
type = 3,
per = 100,
}
m_database["id_22002"] = {
id = 22002,
name = "万花筒写轮眼",
desc = " 我方出手时. 有几率对敌人造成敌人攻击力100%的真实伤害.",
type = 3,
per = 30,
}
m_database["id_22020"] = {
id = 22020,
name = "巨人复仇",
desc = " 被攻击时. 有几率增加60%反击率.",
type = 4,
per = 40,
}
m_database["id_22004"] = {
id = 22004,
name = "超音速",
desc = " 我方闪避时. 获得超音速(增加自身100%速度. 持续1回合)",
type = 4,
per = 100,
}
m_database["id_22008"] = {
id = 22008,
name = "绝对防御",
desc = " 我方格挡时. 有较大几率免除伤害.",
type = 4,
per = 100,
}
m_database["id_22011"] = {
id = 22011,
name = "冰系果实",
desc = " 被攻击时. 有几率获得冰系掌控. 若存在冰系掌控. 则敌人获得冻伤(持续损失血量. 持续1回合)",
type = 4,
per = 20,
}
m_database["id_22014"] = {
id = 22014,
name = "航海王的梦想",
desc = " 受到伤害时. 有几率恢复我方已损失血量的15%.",
type = 4,
per = 60,
}
m_database["id_22018"] = {
id = 22018,
name = "小金刚",
desc = " 受到伤害时. 有几率随机触发(坚硬 不屈 强力)其中一种状态.",
type = 4,
per = 60,
}
m_database["id_22019"] = {
id = 22019,
name = "紧急逃生",
desc = " 当生命值小于30%时. 外套的使用者会激发逃跑的潜能(增加50%闪避率. 持续3回合) \n  (每场战斗只能触发1次)",
type = 4,
per = 100,
}
m_database["id_21001"] = {
id = 21001,
name = "正义裁决",
desc = " 使用正义灌注的力量裁决敌人. 对敌人造成200%伤害. 若敌人血量低于30%. 则斩杀敌人.",
type = 5,
per = 18,
}
m_database["id_21013"] = {
id = 21013,
name = "沉默",
desc = " 对敌人造成极少伤害. 并沉默敌人(不能使用技能. 持续2回合) \n  (每场战斗只能触发2次)",
type = 5,
per = 20,
}
m_database["id_21014"] = {
id = 21014,
name = "冰封",
desc = " 对敌人造成少量伤害. 获得冰系掌控. 并冰冻敌人(无法行动. 持续2回合) \n  若拥有冰系掌握. 对敌人造成冻伤(持续损失血量. 持续1回合) \n  (每场战斗只能触发2次)",
type = 5,
per = 14,
}
m_database["id_21015"] = {
id = 21015,
name = "逆转生命",
desc = " 均衡双方的生命力. 窃取敌人25%当前血量. \n  (此技能无法闪避)",
type = 5,
per = 19,
}
m_database["id_21027"] = {
id = 21027,
name = "剥夺影子",
desc = " 对敌人造成50%伤害. 对敌人造成慌乱(持续损失基于敌人攻击力的血量. 持续4回合)与迟缓(降低敌人30%闪避率. 持续4回合). \n  (此技能无法闪避且只能释放1次)",
type = 5,
per = 20,
}
m_database["id_23003"] = {
id = 23003,
name = "一刀两断",
desc = " 对敌人造成攻击力叠加敌人当前血量30%的伤害. \n  (此技能无法暴击)",
type = 5,
per = 23,
}
m_database["id_23007"] = {
id = 23007,
name = "凋零",
desc = " 对敌人造成100%伤害. 自身损失10%最大血量双倍叠加到攻击力上.",
type = 5,
per = 29,
}
m_database["id_23008"] = {
id = 23008,
name = "砂瀑激流。大层葬",
desc = " 对敌人造成150%伤害. 并使敌人陷入沙漠束缚(降低25%重击率与暴击率. 持续3回合)",
type = 5,
per = 31,
}
m_database["id_23015"] = {
id = 23015,
name = "破道九十 黒棺",
desc = " 对敌人造成140%伤害. 并对敌人造成沉默(无法释放技能. 持续2回合)",
type = 5,
per = 24,
}
m_database["id_23017"] = {
id = 23017,
name = "九头龙闪",
desc = " 对敌人造成170%伤害.  \n  (此技能无法闪避和格挡)",
type = 5,
per = 23,
}
m_database["id_23018"] = {
id = 23018,
name = "七彩葫芦娃",
desc = " 对敌人造成160%伤害. 并随机对敌人造成(沉默 灼烧 晕眩 毒与虚弱)一种状态.",
type = 5,
per = 29,
}
m_database["id_23019"] = {
id = 23019,
name = "巴基弹",
desc = " 对敌人造成150%伤害. 驱散敌人所有有利状态. 刷新所有不利状态.",
type = 5,
per = 30,
}
m_database["id_23020"] = {
id = 23020,
name = "巨人之跃",
desc = " 对敌人造成170%伤害. 降低自身20%防御力. 增加我方15%攻击力 \n  (此技能无法闪避)",
type = 5,
per = 25,
}
m_database["id_21002"] = {
id = 21002,
name = "陨落激光",
desc = " 追加敌人造成100%伤害. 对敌人造成破防(降低25%免伤率. 持续3回合)",
type = 6,
per = 35,
}
m_database["id_21009"] = {
id = 21009,
name = "毫火球术",
desc = " 追加敌人造成95%伤害. 若敌人存在燃烧. 此技能伤害提高80%.",
type = 6,
per = 40,
}
m_database["id_21010"] = {
id = 21010,
name = "毒河豚",
desc = " 追加敌人造成105%伤害. 若敌人存在剧毒. 则抑制敌人回血. 持续2回合.",
type = 6,
per = 31,
}
m_database["id_23001"] = {
id = 23001,
name = "光之雨",
desc = " 漫天的箭雨追加敌人造成数次伤害合计135%伤害. 对敌人造成破防(降低25%免伤率. 持续3回合)",
type = 6,
per = 38,
}
m_database["id_23002"] = {
id = 23002,
name = "须佐能乎",
desc = " 追加敌人造成150%伤害. 若敌人存在燃烧. 此技能伤害提高50%真实伤害. 并刷新燃烧持续时间.",
type = 6,
per = 32,
}
m_database["id_23004"] = {
id = 23004,
name = "月牙天冲",
desc = " 追加敌人造成基础110%伤害. 自身速度越快伤害越高.",
type = 6,
per = 33,
}
m_database["id_23005"] = {
id = 23005,
name = "King",
desc = " 追加敌人造成基础120%伤害. 敌人每一个不利状态都会增加此伤害20%.",
type = 6,
per = 32,
}
m_database["id_23009"] = {
id = 23009,
name = "天马流星拳",
desc = " 追加敌人造成150%伤害. 若自身拥有圣光之盾. 有几率会击晕敌人(无法行动. 持续2回合).",
type = 6,
per = 26,
}
m_database["id_23010"] = {
id = 23010,
name = "大红莲冰轮丸",
desc = " 追加敌人造成150%伤害. 获得冰系掌握. 并对敌人造成冻伤(持续损失血量. 持续1回合).",
type = 6,
per = 27,
}
m_database["id_23011"] = {
id = 23011,
name = "冰河世纪",
desc = " 追加敌人造成130%伤害. 对敌人造成霜寒(降低35%速度值. 持续2回合) \n  若自身拥有冰系掌控. 获得冰系治愈(持续恢复血量. 持续2回合)",
type = 6,
per = 29,
}
m_database["id_23012"] = {
id = 23012,
name = "风遁。螺旋手里剑",
desc = " 追加敌人造成120%伤害. 若自身血量在30%以下. 会释放尾兽玉(伤害增加50%并拥有斩杀效果)",
type = 6,
per = 30,
}
m_database["id_23013"] = {
id = 23013,
name = "神盾局特工",
desc = " 呼叫总部的天空支援. 轰炸该区域. 追加敌人造成190%伤害. ",
type = 6,
per = 19,
}
m_database["id_23014"] = {
id = 23014,
name = "巨人之枪",
desc = " 追加敌人造成110%伤害. 对敌人造成弱化(降低35%攻击力. 持续2回合) \n  若此次攻击暴击. 获得硬化(增加50%防御力. 持续3回合)",
type = 6,
per = 31,
}
m_database["id_23016"] = {
id = 23016,
name = "朝孔雀",
desc = " 追加敌人造成基础120%伤害. 自身五率越高伤害越高.",
type = 6,
per = 29,
}
m_database["id_23021"] = {
id = 23021,
name = "尾兽玉",
desc = " 追加敌人造成180%伤害. ",
type = 6,
per = 30,
}
m_database["id_21032"] = {
id = 21032,
name = "重生",
desc = " 我方死亡之后. 有几率重生. 回复30%血量.随着回合数增加. 复活几率越来越低. \n  (每场战斗只能触发3次)",
type = 7,
per = 90,
}
m_database["id_22009"] = {
id = 22009,
name = "无限小宇宙",
desc = " 我方死亡后复活. 恢复20%血量. 并增加30%全属性. \n  (每场战斗只能触发1次)",
type = 7,
per = 100,
}
m_database["id_21028"] = {
id = 21028,
name = "血之波动",
desc = " 击中敌人后. 自身恢复造成伤害的15%的血量 \n  (永久存在)",
type = 8,
per = 100,
}
m_database["id_21029"] = {
id = 21029,
name = "灵压释放",
desc = " 降低敌人15%格挡率，并使其受到持续伤害 \n  (永久存在)",
type = 8,
per = 100,
}
m_database["id_21030"] = {
id = 21030,
name = "恶魔契约",
desc = " 双方持续受到基于我方最大血量的伤害. 随着回合数增加. 伤害越来越高 \n  (永久存在)",
type = 8,
per = 100,
}
m_database["id_21031"] = {
id = 21031,
name = "虚空刃甲",
desc = " 每次受到敌人伤害时. 敌人损失基于我方防御值的血量 \n  (永久存在)",
type = 8,
per = 100,
}
m_database["id_22015"] = {
id = 22015,
name = "镜花水月",
desc = " 战斗开始后. 敌人在3回合内无法使用技能.",
type = 8,
per = 100,
}
m_database["id_22016"] = {
id = 22016,
name = "热血的青春",
desc = " 战斗开始后. 我方增加15%五率(重击 暴击 格挡 反击 闪避).",
type = 8,
per = 100,
}

